ta-example-soap/sample/homework/homework-3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://kodilla.com/courses/soap">
    <soapenv:Header/>
    <soapenv:Body>
        <soap:getCourseRequest>
            <soap:name>Tester</soap:name>
        </soap:getCourseRequest>
    </soapenv:Body>
</soapenv:Envelope>